package com.nurimaps.feature.uwb

object AnchorRepository {

    //===========================================================
    //    층	왼쪽 높이 (m)	중앙 높이 (m)	오른쪽 높이 (m)
    //    3층	7.65	        7.93	        8.20
    //    3.5층	9.50	        9.83	        10.05
    //    4층	11.75	        11.85	        11.95
    //===========================================================

    // 22개 앵커의 ID 및 좌표 값 (예시 좌표입니다. 실제 값으로 바꾸세요)
    private val anchors = listOf(
        // 3층 복도 앵커(2.08m 높이에 설치)
        Anchor(1, 0.0, 0.0, 9.73),
        Anchor(2, 27.1, 0.0, 10.01),
        Anchor(3, 36.5, 0.0, 10.01),
        Anchor(4, 63.5, 0.0, 10.28),

        // 3층 복도 앵커(1.3m 높이에 설치)
        Anchor(5, 13.5, 2.1, 9.09),
        Anchor(6, 49.9, 2.1, 9.36),

        // 3층 -> 3.5층 계단(2.08m 높이에 설치)
        Anchor(7, 0.0, 5.0, 9.73),
        Anchor(8, 36.5, 4.9, 10.01),
        Anchor(9, 63.5, 2.8, 10.28),
        Anchor(10, 0.0, 9.6, 11.58),
        Anchor(11, 36.5, 9.9, 11.91),
        Anchor(12, 63.5, 9.9, 12.13),

        // 4층 복도 앵커(2.08m 높이에 설치)
        Anchor(13, 0.0, 0.0, 11.75),
        Anchor(14, 11.1, 1.97, 11.8),
        Anchor(15, 26.3, 0.0, 11.85),
        Anchor(16, 36.0, 0.0, 11.85),

        // 4층 복도 앵커(1.3m 높이에 설치)
        Anchor(17, 49.4, 1.97, 11.9),
        Anchor(18, 62.9, 0.0, 11.95),

        // 3.5층 -> 4층 계단(2.08m 높이에 설치)
        Anchor(19, -4.2, 5.3, 13.83),
        Anchor(20, 26.3, 5.2, 13.93),
        Anchor(21, 66.65, 3.1, 14.03),
        Anchor(22, -4.2, 9.6, 11.58),
        Anchor(23, 26.3, 9.9, 11.91),
        Anchor(24, 66.65, 9.9, 12.13)
    )

    // 앵커 ID로 특정 앵커 좌표 가져오기
    fun getAnchorById(id: Int): Anchor? {
        return anchors.find { it.id == id }
    }
}